benchmarks/results/rest-summary.txt
Running 30s test @ http://127.0.0.1:3102/internal/v1/repositories/verify
50 connections


┌─────────┬──────┬──────┬───────┬──────┬─────────┬─────────┬────────┐
│ Stat    │ 2.5% │ 50%  │ 97.5% │ 99%  │ Avg     │ Stdev   │ Max    │
├─────────┼──────┼──────┼───────┼──────┼─────────┼─────────┼────────┤
│ Latency │ 2 ms │ 2 ms │ 5 ms  │ 7 ms │ 2.69 ms │ 2.88 ms │ 192 ms │
└─────────┴──────┴──────┴───────┴──────┴─────────┴─────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬───────────┬──────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg       │ Stdev    │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼───────────┼──────────┼─────────┤
│ Req/Sec   │ 8,535   │ 8,535   │ 15,791  │ 16,319  │ 14,826.14 │ 2,009.26 │ 8,532   │
├───────────┼─────────┼─────────┼─────────┼─────────┼───────────┼──────────┼─────────┤
│ Bytes/Sec │ 2.06 MB │ 2.06 MB │ 3.81 MB │ 3.93 MB │ 3.57 MB   │ 484 kB   │ 2.06 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴───────────┴──────────┴─────────┘

Req/Bytes counts sampled once per second.
# of samples: 30

445k requests in 30.02s, 107 MB read